[{"postID":"2","postDate":"13 July 2022","postTitle":"Supper Club","postContent":"On the last Thursday of every month, we host our own supper club. The evenings are themed, so the menu reflects the chosen theme.\r\n\r\nExamples of recent themes are a Spanish evening when we served patatas bravos, paella, churros and a French evening when we served French onion soup, chicken chasseur and tartatan.\r\n\r\nClients friends and family are welcome. For information on our next supper club, give us a call.","postLink":"","postImage":"victoria-shes-Qa29U4Crvn4-unsplash.jpg"},{"postID":"1","postDate":"13 July 2022","postTitle":"Alanmart Choir","postContent":"One of the favourite events at Alanmart is a singsong. Everyone reports that they feel better after participating in a song or two.\r\n\r\nNow we want to develop this and launch a choir for clients, carers, family, friends, and locals who would like to give it a go. Singer and musician Kim Edgar who performs all over Europe and the USA gave expert advice and were hiring a professional choir master. \r\n\r\nThe benefits of a choir are well documented. These include stress relief, improved mood., better breathing and lung function. It has also been shown to help memory in those with dementia and to improve speech. \r\n\r\nOur choir master will arrange tunes so we can all take part and no auditions necessary. If you are interested, don't hesitate to get in touch with us.","postLink":"","postImage":"darren-coleshill-XeArotc35UE-unsplash.jpg"},{"postID":"0","postDate":"1 May 2022","postTitle":"Duty of Candour Annual Report","postContent":"All regulated care services have a duty of candour. This is a legal requirement which means that when things go wrong and mistakes happen the people affected understand what has happened, receive an apology and that the organisation learn how to improve for the future.\r\n\r\nPart of the legislation requires Alanmart to publish an annual report about duty of candour in our services. This short report describes how Alanmart has operated the duty of candour between 1st April 2021 and 31st March 2022.\r\n\r\nAlanmart day care is a social care facility in Stenhousemuir. We are operating a service for up to 10 clients, twice a day, providing social care for people who need some assistance with an aspect of life that through illness or infirmity can no longer provide for themselves. \r\n\r\nWe aim to ensure that each client has a positive experience every time they attend Alanmart and that care we give is personal, tailored to the needs of the individual. The incidents to be included in an annual report of Duty of Candour are those which are unintended or unexpected and do not relate directly to the natural course of someone’s illness or underlying condition. \r\n\r\nWe are happy to report that over the course of the year we have had no occasions to trigger using the Duty of Candour Requirement The care inspectorate’s website has more information on the Duty of Candour where you can also find information regarding Alanmart’s Inspection Reports carried out by the Inspectorate.","postLink":"http:\/\/www.careinspectorate.com","postImage":""}]